ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l211x_l112x/COMP0_1.0.xml
    <register id="COMP0_CTL3" width="32" offset="0x110C" description="Control 3">
        <bitfield id="DACCODE0" description="This is the first 8-bit DAC code. When the DAC code is 0x0 the DAC output will be selected reference voltage x 1/256 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256 V." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
        <bitfield id="DACCODE1" description="This is the second 8-bit DAC code. When the DAC code is 0x0 the DAC output will be selected reference voltage x 1/256 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256 V." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
    </register>
    <register id="COMP0_STAT" width="32" offset="0x1120" description="Status">
        <bitfield id="OUT" description="This bit reflects the value of the comparator output. Writing to this bit has no effect on the comparator output." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="LOW" value="0x0" description="Comparator output is low"/>
            <bitenum id="HIGH" value="0x1" description="Comparator output is high"/>
        </bitfield>
    </register>
    <register id="COMP0_ANACMPWKUPCTL" width="32" offset="0x1140" description="Analog comparison wakeup control register">
        <bitfield id="ANACMPWKUPEN" description="0: Analog comparison wakeup is disabled (back ward compatible with existing IP)
1 : Analog comparison feature is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="COMP0_ANACMPCTRCTL" width="32" offset="0x1144" description="Analog comparison counter control register">
        <bitfield id="BLKCMPPRD" description="Blanking and comparision period" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="CMPPRD" description="Comparision period" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="COMP0_ANACMPDACCODE" width="32" offset="0x1148" description="Analog comparison DAC codes">
        <bitfield id="IP0DACCODE" description="Input0 daccode value" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="IP1DACCODE" description="Input1 daccode value" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="IP2DACCODE" description="Input2 daccode value" begin="23" end="16" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="IP3DACCODE" description="Input3 daccode value" begin="31" end="24" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="COMP0_ANACMPWD" width="32" offset="0x114C" description="Window operation control for analog comparison">
        <bitfield id="WDEN" description="0 :  Window mode disable
1 :  Window mode enable" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INMUXSEL_WD" description="Input mux (Static) selection for window mode" begin="2" end="1" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="COMP0_ANACMPCHSTS" width="32" offset="0x1150" description="Status flag to indicate input channel event genration">
        <bitfield id="IN0EVT" description="Input0 caused event" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="IN1EVT" description="Input1 caused event" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="IN2EVT" description="Input2 caused event" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="IN3EVT" description="Input3 caused event" begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="COMP0_ANACMPCHSTSCLR" width="32" offset="0x1154" description="Clear register for ANACMPCHSTS status register">
        <bitfield id="IN0EVTCLR" description="Write a 1 to clear corresponding Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="IN1EVTCLR" description="Write a 1 to clear corresponding Interrupt." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="IN2EVTCLR" description="Write a 1 to clear corresponding Interrupt." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="IN3EVTCLR" description="Write a 1 to clear corresponding Interrupt." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>

</module>